db.SourceFlag.insert([
  { code: " ", description: "No source (i.e., data value missing)" },
  { code: "0", description: "U.S. Cooperative Summary of the Day (NCDC DSI-3200)" },
  { code: "6", description: "CDMP Cooperative Summary of the Day (NCDC DSI-3206)" },
  { code: "7", description: "U.S. Cooperative Summary of the Day -- Transmitted via WxCoder3 (NCDC DSI-3207)" },
  { code: "A", description: "U.S. Automated Surface Observing System (ASOS) real-time data (since January 1, 2006)" },
  { code: "a", description: "Australian data from the Australian Bureau of Meteorology" },
  { code: "B", description: "U.S. ASOS data for October 2000-December 2005 (NCDC DSI-3211)" },
  { code: "b", description: "Belarus update" },
  { code: "C", description: "Environment Canada" },
  { code: "D", description: "Short time delay US National Weather Service CF6 daily summaries provided by the High Plains Regional Climate Center" },
  { code: "E", description: "European Climate Assessment and Dataset (Klein Tank et al., 2002)" },	   
  { code: "F", description: "U.S. Fort data" },
  { code: "G", description: "Official Global Climate Observing System (GCOS) or other government-supplied data" },
  { code: "H", description: "High Plains Regional Climate Center real-time data" },
  { code: "I", description: "International collection (non U.S. data received throughpersonal contacts)" },
  { code: "K", description: "U.S. Cooperative Summary of the Day data digitized frompaper observer forms (from 2011 to present)" },
  { code: "M", description: "Monthly METAR Extract (additional ASOS data)" },
  { code: "N", description: "Community Collaborative Rain, Hail,and Snow (CoCoRaHS)" },
  { code: "Q", description: "Data from several African countries that had been 'quarantined', that is, withheld from public release until permission was granted from the respective  meteorological services" },
  { code: "R", description: "NCEI Reference Network Database (Climate Reference Network and Regional Climate Reference Network)" },
  { code: "r", description: "All-Russian Research Institute of Hydrometeorological Information-World Data Center" },
  { code: "S", description: "Global Summary of the Day (NCDC DSI-9618) NOTE: 'S' values are derived from hourly synoptic reports exchanged on the Global Telecommunications System (GTS). Daily values derived in this fashion may differ significantly from 'true' daily data, particularly for precipitation (i.e., use with caution)." },
  { code: "s", description: "China Meteorological Administration/National Meteorological Information Center/Climatic Data Center (http://cdc.cma.gov.cn)" },
  { code: "T", description: "SNOwpack TELemtry (SNOTEL) data obtained from the U.S. Department of Agriculture's Natural Resources Conservation Service" },
  { code: "U", description: "Remote Automatic Weather Station (RAWS) data obtained from the Western Regional Climate Center" },
  { code: "u", description: "Ukraine update" },
  { code: "W", description: "WBAN/ASOS Summary of the Day from NCDC's Integrated Surface Data (ISD)." },
  { code: "X", description: "U.S. First-Order Summary of the Day (NCDC DSI-3210)" },
  { code: "Z", description: "Datzilla official additions or replacements" },
  { code: "z", description: "Uzbekistan update" },
])